[
  {
    "Sorte": "大吉",
    "Estrelas": "★★★★★★★",
    "signText": "福星高照，万事如意，家宅平安，财源广进",
    "unSignText": "此签为大吉之兆，福星高照，万事如意。家宅平安，财源广进。运势极佳，无论事业、财运、感情皆顺利。宜把握时机，积极进取，但需保持谦虚，避免乐极生悲。"
  },
  {
    "Sorte": "中吉",
    "Estrelas": "★★★★★★☆",
    "signText": "云开见月，花发逢春，舟行顺风，任意前进",
    "unSignText": "乌云散去，月亮重现光明；花朵遇到春天而绽放；船只顺风而行，任意前进。此签表示困境即将过去，好运来临，凡事渐入佳境。需把握时机，顺势而为，但不可急躁，稳中求进。"
  },
  {
    "Sorte": "小吉",
    "Estrelas": "★★★★★☆☆",
    "signText": "春回大地，万物复苏，勤勉努力，必有收获",
    "unSignText": "春天回归大地，万物开始复苏，只要勤勉努力，必定会有收获。此签象征新的开始，运势平稳上升。宜脚踏实地，持之以恒，不可投机取巧。"
  },
  {
    "Sorte": "吉",
    "Estrelas": "★★★★☆☆☆",
    "signText": "贵人相助，事倍功半，机缘巧合，成功在望",
    "unSignText": "得到贵人扶持，事情事半功倍；机缘巧合下，成功在望。此签提示多结交良友，善用外力，可化解困难。但需自身努力，不可完全依赖他人。"
  },
  {
    "Sorte": "半吉",
    "Estrelas": "★★★☆☆☆☆",
    "signText": "山路崎岖，行路艰难，小心谨慎，可保平安",
    "unSignText": "前路坎坷，行事需谨慎，方能化险为夷。此签表示运势平平，有惊无险，需靠自己努力，并听取他人建议。避免冒险，稳守当前。"
  },
  {
    "Sorte": "平",
    "Estrelas": "★★☆☆☆☆☆",
    "signText": "风平浪静，波澜不惊，稳扎稳打，步步为营",
    "unSignText": "运势平稳，无风无浪，生活平淡安详。不必过分计较吉凶，只要耐心坚守，自会看到转机。此签表示顺其自然，知足常乐。"
  },
  {
    "Sorte": "末吉",
    "Estrelas": "★★☆☆☆☆☆",
    "signText": "先苦后甜，否极泰来，坚持到底，胜利在望",
    "unSignText": "起初困难，但后来逐渐顺利，不要灰心。苦难过后好运来临，坚持到底，胜利在望。此签提示坚持就是胜利，终有收获。"
  },
  {
    "Sorte": "吉带凶",
    "Estrelas": "★☆☆☆☆☆☆",
    "signText": "吉中藏凶，欲速不达，进不如守，可保安祥",
    "unSignText": "好运中隐藏着危机，不可轻举妄动，坚守本分、谨慎行事才能避免危险。如果贪图短期利益，可能带来长期麻烦。此签提醒需居安思危，稳扎稳打。"
  },
  {
    "Sorte": "凶",
    "Estrelas": "☆☆☆☆☆☆☆",
    "signText": "乌云遮月，前路茫茫，谨慎行事，免遭灾祸",
    "unSignText": "运势低迷，如乌云遮月，前途暗淡，困难重重。需特别小心，避免冲动，以免招灾。此时宜静不宜动，等待时机转变，保持冷静。"
  },
  {
    "Sorte": "大凶",
    "Estrelas": "☆☆☆☆☆☆☆",
    "signText": "狂风暴雨，舟船飘摇，行善积德，可免灾殃",
    "unSignText": "运势极差，如暴风雨中的小船，危险四伏。前行之路充满险阻，若不积德行善，可能灾祸临头。此签警告宜修身养性，避免冒险，祈求平安。"
  },
  {
    "Sorte": "大吉",
    "Estrelas": "★★★★★★★",
    "signText": "天官赐福，地祇送财，人间安康，天下太平",
    "unSignText": "此签为大吉之兆，天官赐福，地神送财，人间安康，天下太平。运势旺盛，百事亨通。宜行善积德，共享太平，但需防骄矜。"
  },
  {
    "Sorte": "中吉",
    "Estrelas": "★★★★★★☆",
    "signText": "龙腾虎跃，气势如虹，努力奋斗，必成大业",
    "unSignText": "如龙腾虎跃，气势如虹，只要努力奋斗，必能成就大业。此签表示运势强劲，事业可成。但需注意团队合作，避免独断专行。"
  },
  {
    "Sorte": "小吉",
    "Estrelas": "★★★★★☆☆",
    "signText": "竹报平安，梅开五福，家庭和睦，健康长寿",
    "unSignText": "竹子报告平安，梅花绽放五福，家庭和睦，健康长寿。此签象征家庭幸福，身体健康。运势平稳，宜注重家庭关系，保养身体。"
  },
  {
    "Sorte": "吉",
    "Estrelas": "★★★★☆☆☆",
    "signText": "天赐良缘，喜结连理，夫妻恩爱，白头偕老",
    "unSignText": "上天赐予美好姻缘，喜结连理，夫妻恩爱，白头偕老。此签主感情运势佳，宜把握缘分，真诚对待。但需相互包容，避免争执。"
  },
  {
    "Sorte": "半吉",
    "Estrelas": "★★★☆☆☆☆",
    "signText": "浮云蔽日，暂时昏暗，耐心等待，云开见天",
    "unSignText": "浮云遮挡太阳，暂时昏暗，需耐心等待，云散见天。此签表示暂时困难，但终会过去。宜保持信心，不可放弃。"
  },
  {
    "Sorte": "平",
    "Estrelas": "★★☆☆☆☆☆",
    "signText": "秋水共长，天一色色，渔舟唱晚，响穷彭蠡",
    "unSignText": "运势如秋水长天，渔舟唱晚，平淡中见真趣。此签表示生活安稳，无大起大落。宜享受当下，修身养性。"
  },
  {
    "Sorte": "末吉",
    "Estrelas": "★★☆☆☆☆☆",
    "signText": "枯木逢春，再现生机，把握机会，东山再起",
    "unSignText": "枯木遇到春天，再现生机，把握机会，可东山再起。此签表示运势转好，逆境中看到希望。宜积极行动，不可错失良机。"
  },
  {
    "Sorte": "吉带凶",
    "Estrelas": "★☆☆☆☆☆☆",
    "signText": "福祸相依，得失相伴，知足常乐，可避风险",
    "unSignText": "福与祸相互依存，得与失相伴而行，知足常乐，可避开风险。此签提醒凡事有度，不可贪心，保持平常心。"
  },
  {
    "Sorte": "凶",
    "Estrelas": "☆☆☆☆☆☆☆",
    "signText": "虎落平阳，被犬所欺，忍气吞声，以待时机",
    "unSignText": "老虎落到平阳，被狗欺负，需忍气吞声，等待时机。此签表示运势低落，遭人欺凌。宜低调忍耐，积蓄力量，以待翻身。"
  },
  {
    "Sorte": "大凶",
    "Estrelas": "☆☆☆☆☆☆☆",
    "signText": "灾星降临，厄运缠身，修身养性，祈求平安",
    "unSignText": "灾星降临，厄运缠身，需修身养性，祈求平安。此签警告运势极差，可能遇灾祸。宜行善积德，谨慎行事，避免更大损失。"
  }
]
